package testForMoonshineCalc;

import java.util.Arrays;

class ArrayInit {


    //температура кипения С
    static final double[] tkip = {79.1, 79.2, 79.4, 79.6, 79.7, 79.9, 80.2, 80.3, 80.5, 80.6, 80.8, 81, 81.2,
            81.3, 81.5, 81.7, 81.9, 82.1, 82.4, 82.6, 82.8, 83.0, 83.3, 83.5, 83.8, 84.1, 84.4, 84.7, 85.0, 85.3, 85.7,
            86.2, 86.6, 87.1, 87.7, 88.3, 89.0, 89.7, 90.6, 91.5, 92.6, 93.9, 95.2, 96.6, 98.2, 100.0};

    //масса остатка, кг
    static final double[] ostMass = {1000.0, 536.0, 355.0, 264.0, 208.0, 172.0, 146.0, 127.0, 111.0, 99.3, 89.9, 82.0, 75.3, 69.5,
            64.7, 60.4, 56.6, 53.3, 50.2, 47.6, 45.2, 43.1, 41.1, 39.2, 37.6, 36.0, 34.6, 33.3, 32.0, 30.8, 29.7, 28.6, 27.6, 26.7,
            25.9, 24.9, 24.0, 23.2, 22.3, 21.5, 20.7, 19.9, 19.0, 18.1, 17.1, 14.5};
    //объемная доля спирта 5408 ,4499.07,3222.45,2106.45,1874.45,1660.3,1446.15,
    //4203.3234, 3542.5435, 2954.2202, 2431.1763, 1977.2321, 1584.9651, 1248.5773
    //5295.0319, 4282.0881, 3431.3178, 2718.8243, 2136.8774, 1663.6703, 1281.6395
    //4635.7802, 3881.9972, 3238.3503, 2684.1364, 2206.8076, 1804.3895, 1465.2072, 1179.8408
    //3607.1321, 3035.3545, 2539.8303, 2109.9643, 1744.6345, 1433.9314, 1169.8472
    static double[] spiritPercentsVol = new double[tkip.length];
    //массовая доля спирта
    //static final double[] spvReverse = CalculateSimpleDistill.massSwap(Arrays.copyOf(getSpiritPercentsVol(spiritPercentsVol),spiritPercentsVol.length));
    static final double[] spiritPercentsMass = {85.8, 83.2, 80.7, 78.3, 75.9, 73.6, 71.3, 69.1, 66.8, 64.6, 62.5,
            60.4, 58.3, 56.2, 54.2, 52.2, 50.2, 48.3, 46.3, 44.4, 42.5, 40.7, 38.8, 37.0, 35.2, 33.4, 31.6, 29.9, 28.1, 26.4, 24.7, 23.0,
            21.3, 19.6, 17.9, 16.3, 14.6, 13.0, 11.3, 9.7, 8.1, 6.4, 4.8, 3.2, 1.6, 0.0};

//    95.57,94.2, 92.65,92,90.7,89.5,88.3,

    //static double[] spmReverse = CalculateSimpleDistill.massSwap(Arrays.copyOf(spiritPercentsMass,spiritPercentsMass.length));
    static final double[] densityWaterSpirit = {9982, 9964, 9945, 9928, 9910, 9894, 9878, 9863, 9848, 9833, 9819, 9805, 9791, 9778, 9761, 9751, 9739,
            9726, 9713, 9700, 9686, 9673, 9659, 9643, 9631, 9617, 9602, 9587, 9571, 9555, 9538, 9521, 9504, 9486, 9468, 9449, 9431, 9411, 9392, 9372, 9352, 9331, 9311,
            9290, 9269, 9247, 9226, 9204, 9182, 9160, 9138, 9116, 9094, 9071, 9049, 9026, 9003, 8980, 8957, 8934, 8911, 8888, 8865, 8842, 8818, 8795, 8771, 8748, 8724,
            8700, 8677, 8653, 8629, 8605, 8581, 8556, 8532, 8508, 8484, 8459, 8434, 8410, 8385, 8360, 8335, 8310, 8284, 8258, 8232, 8206, 8180, 8153, 8126, 8098, 8071,
            8042, 8014, 7985, 7955, 7924, 7893};

    static  double[] massPercForDensity = new double[densityWaterSpirit.length];

//    static final double[] ostmReverse = CalculateSimpleDistill.massSwap(Arrays.copyOf(ostMass,ostMass.length));
//
//    static void setMassPercForDensity() {
//        for (int i = 0; i < densityWaterSpirit.length; ++i) {
//            massPercForDensity[i] = i;
//        }
//    }

    private static double[] getSpiritPercentsVol(double[]b) {


        b[0]=97.0;
        b[1]=96.0;
        b[2]=95.0;
        b[3]=94.0;
        b[4]=93.0;
        b[5]=92.0;
        b[6]=91.0;

//        b[0]=97.18;
//        b[1]=96.25;
//        b[2]=95.17;
//        b[3]=94.71;
//        b[4]=93.78;
//        b[5]=92.90;
//        b[6]=92.01;


        int a = 92;
        for (int i = 7; i < b.length; ++i) {
            b[i] = a - 2;
            a = a - 2;
        }

        return b;
    }
}
